name: "ensemble_yolo"
platform: "ensemble"
max_batch_size: 32

input [
  {
    name: "INPUT"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  }
]

output [
  {
    name: "FINAL_OUTPUT"
    data_type: TYPE_FP32
    dims: [ 84, -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess"
      model_version: -1
      input_map {
        key: "INPUT"
        value: "INPUT"
      }
      output_map {
        key: "images"
        value: "images"
      }
    },
    {
      model_name: "yolo"
      model_version: -1
      input_map {
        key: "images"
        value: "images"
      }
      output_map {
        key: "output0"
        value: "output0"
      }
    },
    {
      model_name: "postprocess"
      model_version: -1
      input_map {
        key: "output0"
        value: "output0"
      }
      output_map {
        key: "FINAL_OUTPUT"
        value: "FINAL_OUTPUT"
      }
    }
  ]
}
